## Basics data frame

In [1]:
import pandas as pd
# load data - change the path to match your drive!
basics = pd.read_csv('Data/title_basics.csv.gz')
basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 87588 entries, 0 to 87587
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   imdb id         87588 non-null  object
 1   titleType       87588 non-null  object
 2   primaryTitle    87588 non-null  object
 3   originalTitle   87588 non-null  object
 4   isAdult         87588 non-null  int64
 5   startYear       87588 non-null  float64
 6   endYear         0 non-null      float64
 7   runtimeMinutes  87588 non-null  int64
 8   genres          87588 non-null  object
dtypes: float64(2), int64(2), object(5)
memory usage: 6.0+ MB

### Removing unwanted columns from Basics

In [2]:
basics = basics.drop(columns=['titleType', 'originalTitle','isAdult','endYear'])
basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 87588 entries, 0 to 87587
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   imdb id         87588 non-null  object
 1   primaryTitle    87588 non-null  object
 2   startYear       87588 non-null  float64
 3   runtimeMinutes  87588 non-null  int64
 4   genres          87588 non-null  object
dtypes: float64(1), int64(1), object(3)
memory usage: 3.3+ MB

### Genres separation and creating columns

In [3]:
## adding expand=True
basics['genres_split'] = basics['genres'].str.split(',')

In [4]:
## exploding the column of lists
exploded_genres = basics.explode('genres_split')
exploded_genres

,imdb id,primaryTitle,startYear,runtimeMinutes,genres,genres_split
0,tt0035423,Kate & Leopold,2001.0,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,Kate & Leopold,2001.0,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,Kate & Leopold,2001.0,118,"Comedy,Fantasy,Romance",Romance
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70,Drama,Drama
2,tt0069049,The Other Side of the Wind,2018.0,122,Drama,Drama
...,...,...,...,...,...,...
87586,tt9916190,Safeguard,2020.0,95,"Action,Adventure,Thriller",Action
87586,tt9916190,Safeguard,2020.0,95,"Action,Adventure,Thriller",Adventure
87586,tt9916190,Safeguard,2020.0,95,"Action,Adventure,Thriller",Thriller
87587,tt9916362,Coven,2020.0,92,"Drama,History",Drama
87587,tt9916362,Coven,2020.0,92,"Drama,History",History

In [5]:
unique_genres = sorted(exploded_genres['genres_split'].unique())

In [6]:
basics = basics.drop(columns ='genres_split')
basics.head()

,imdb id,primaryTitle,startYear,runtimeMinutes,genres
0,tt0035423,Kate & Leopold,2001.0,118,"Comedy,Fantasy,Romance"
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70,Drama
2,tt0069049,The Other Side of the Wind,2018.0,122,Drama
3,tt0082328,Embodiment of Evil,2008.0,94,Horror
4,tt0088751,The Naked Monster,2005.0,100,"Comedy,Horror,Sci-Fi"

### Create a new title_genres table

In [7]:
title_genres = exploded_genres[['imdb id','genres_split']].copy()
title_genres.head()

     imdb id genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0069049        Drama

### Create a genres table

In [8]:
## Making the genre mapper dictionary
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Sport': 20,
 'Talk-Show': 21,
 'Thriller': 22,
 'War': 23,
 'Western': 24}

In [9]:
## Manually make dataframe with named cols from .keyd and .values
genres = pd.DataFrame({'Genre_ID':genre_map.values(),
                       'Genre_name': genre_map.keys()})
genres.head()

   Genre_ID Genre_name
0         0     Action
1         1      Adult
2         2  Adventure
3         3  Animation
4         4  Biography

In [10]:
## save data for next lesson
basics.to_csv('Title Basics.csv', index=False)

### Ratings Dataframe

In [11]:
ratings = pd.read_csv('Data/title_ratings.csv.gz')
ratings.head()
ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 515708 entries, 0 to 515707
Data columns (total 3 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   imdb id        515708 non-null  object
 1   averageRating  515708 non-null  float64
 2   numVotes       515708 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 11.8+ MB

In [12]:
## save data for next lesson
ratings.to_csv('Title Ratings.csv', index=False)

### TMDB_API Dataframe

In [13]:
tmdb_api = pd.read_csv("Data/tmdb_results_combined.csv.gz")
tmdb_api.head()
tmdb_api.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18661 entries, 0 to 18660
Data columns (total 26 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   imdb_id                18661 non-null  object
 1   adult                  18660 non-null  float64
 2   backdrop_path          10505 non-null  object
 3   belongs_to_collection  1405 non-null   object
 4   budget                 18660 non-null  float64
 5   genres                 18660 non-null  object
 6   homepage               3548 non-null   object
 7   id                     18660 non-null  float64
 8   original_language      18660 non-null  object
 9   original_title         18660 non-null  object
 10  overview               18215 non-null  object
 11  popularity             18660 non-null  float64
 12  poster_path            16496 non-null  object
 13  production_companies   18660 non-null  object
 14  production_countries   18660 non-null  object
 15  release_date           18300 non-null  object
 16  revenue                18660 non-null  float64
 17  runtime                18660 non-null  float64
 18  spoken_languages       18660 non-null  object
 19  status                 18660 non-null  object
 20  tagline                7844 non-null   object
 21  title                  18660 non-null  object
 22  video                  18660 non-null  float64
 23  vote_average           18660 non-null  float64
 24  vote_count             18660 non-null  float64
 25  certification          5382 non-null   object
dtypes: float64(9), object(17)
memory usage: 3.7+ MB

### Removing unwanted columns from Ratings

In [14]:
tmdb_api = tmdb_api.drop(columns=['adult', 'backdrop_path', 'belongs_to_collection', 'genres','homepage', 'id',
                                  'original_language', 'original_title', 'overview','popularity','poster_path',
                                  'production_companies', 'production_countries','release_date','runtime','spoken_languages',
                                  'status','tagline','title','video','vote_average','vote_count'])
tmdb_api.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18661 entries, 0 to 18660
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   imdb_id        18661 non-null  object
 1   budget         18660 non-null  float64
 2   revenue        18660 non-null  float64
 3   certification  5382 non-null   object
dtypes: float64(2), object(2)
memory usage: 583.3+ KB

In [15]:
tmdb_api.head()

     imdb_id      budget     revenue certification
0          0         NaN         NaN           NaN
1  tt0035423  48000000.0  76019048.0         PG-13
2  tt0114447         0.0         0.0           NaN
3  tt0118589  22000000.0   5271666.0         PG-13
4  tt0118652   1000000.0         0.0             R

In [16]:
# remove ids that are 0
tmdb_api = tmdb_api.loc[ tmdb_api['imdb_id']!='0']
tmdb_api

         imdb_id      budget     revenue certification
1      tt0035423  48000000.0  76019048.0         PG-13
2      tt0114447         0.0         0.0           NaN
3      tt0118589  22000000.0   5271666.0         PG-13
4      tt0118652   1000000.0         0.0             R
5      tt0119004         0.0      6297.0           NaN
...          ...         ...         ...           ...
18656  tt7851834         0.0         0.0           NaN
18657  tt8090084         0.0         0.0           NaN
18658  tt8160720         0.0         0.0           NaN
18659  tt9164254         0.0         0.0         NC-17
18660  tt9575206         0.0         0.0           NaN

[18660 rows x 4 columns]

In [17]:
tmdb_api = tmdb_api.rename(columns ={'imdb_id':'imdb id'})
tmdb_api.head()

     imdb id      budget     revenue certification
1  tt0035423  48000000.0  76019048.0         PG-13
2  tt0114447         0.0         0.0           NaN
3  tt0118589  22000000.0   5271666.0         PG-13
4  tt0118652   1000000.0         0.0             R
5  tt0119004         0.0      6297.0           NaN

In [18]:
tmdb_api = tmdb_api.reset_index(drop=True)
tmdb_api

         imdb id      budget     revenue certification
0      tt0035423  48000000.0  76019048.0         PG-13
1      tt0114447         0.0         0.0           NaN
2      tt0118589  22000000.0   5271666.0         PG-13
3      tt0118652   1000000.0         0.0             R
4      tt0119004         0.0      6297.0           NaN
...          ...         ...         ...           ...
18655  tt7851834         0.0         0.0           NaN
18656  tt8090084         0.0         0.0           NaN
18657  tt8160720         0.0         0.0           NaN
18658  tt9164254         0.0         0.0         NC-17
18659  tt9575206         0.0         0.0           NaN

[18660 rows x 4 columns]

In [19]:
## save data for next lesson
tmdb_api.to_csv('TMDB API Results.csv', index=False)

## SQL

In [20]:
# imports
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
from urllib.parse import quote_plus as urlquote
# Create connection string using credentials following this format

In [21]:
import json
with open('/Users/miran/.secret/mysql.json') as f:
    login = json.load(f)
login.keys()

dict_keys(['username', 'password'])

In [22]:
connection = f"mysql+pymysql://{login['username']}:{urlquote(login['password'])}@localhost/movie"

In [23]:
# create sqlite engine for a database called schools
engine = create_engine(connection)
# create connection to engine
conn = engine.connect()

In [24]:
database_exists(connection)

True

In [25]:
## Check if database exists, if not, create it
if database_exists(connection):
    print('It exists!')
else:
    create_database(connection)
    print('Database created!')

It exists!

In [26]:
from sqlalchemy.types import *

# Calculate max string lengths for object columns

key_len = basics['imdb id'].fillna('').map(len).max()
title_len = basics['primaryTitle'].fillna('').map(len).max()
genre_name_len = genres['Genre_name'].fillna('').map(len).max()
certification_len = tmdb_api['certification'].fillna('').map(len).max()

# Create a schema dictonary using Sqlalchemy datatype objects

basics_schema = {
    "imdb id": String(key_len+1), "primaryTitle": Text(title_len+1),
    'startYear': Float(), 'endYear': Float(),
    'runtimeMinutes': Integer(), 'averageRating': Float(),
    'numVotes': Integer(),'Genre_ID': Integer(),'Genre_Name': Text(genre_name_len+1),
    'imdb id': String(key_len+1), 'revenue': Float(), 'budget': Float(), 
    'certification': Text(certification_len+1)}

In [27]:
# Save to sql with dtype and index=False
basics.to_sql('title_basics',engine,dtype=basics_schema,if_exists='replace',index=False)

87588

In [28]:
# Save to sql with dtype and index=False
genres.to_sql('genres',engine,dtype=basics_schema,if_exists='replace',index=False)

25

In [29]:
# Save to sql with dtype and index=False
title_genres.to_sql('title_genres',engine,dtype=basics_schema,if_exists='replace',index=False)

164039

In [30]:
# Save to sql with dtype and index=False
tmdb_api.to_sql('tmdb_data',engine,dtype=basics_schema,if_exists='replace',index=False)

18660

In [31]:
# Save to sql with dtype and index=False
ratings.to_sql('title_ratings',engine,dtype=basics_schema,if_exists='replace',index=False)

515708

In [32]:
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`imdb id`);')

In [33]:
q = '''SHOW TABLES'''
pd.read_sql(q,engine)

  Tables_in_movie
0          genres
1    title_basics
2    title_genres
3   title_ratings
4       tmdb_data